; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl)

(:types link joint angle)

(:predicates
	(Connected ?j - joint ?l - link) 
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?a - angle ?j - joint)
)

(:action increase_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(Connected ?joint ?link1)
	(Connected ?joint ?link2)
	(not (= ?link1 ?link2))
	(HasAngle ?a1 ?joint)
	(AngleOrd ?a1 ?a2)
	)
:effect (and 
	(not (HasAngle ?a1 ?joint)) 
	(HasAngle ?a2 ?joint)
	)
)

(:action decrease_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(Connected ?joint ?link1)
	(Connected ?joint ?link2)
	(not (= ?link1 ?link2))
	(HasAngle ?a1 ?joint)
	(AngleOrd ?a2 ?a1)
	)
:effect (and 
	(not (HasAngle ?a1 ?joint)) 
	(HasAngle ?a2 ?joint)
	)
)
)

; problem
(define (problem joint_bar_1)
(:domain joint_bar)
(:objects
    link1 link2 link3 - link
    joint1 joint2 - joint
    angle0 angle45 angle90 angle135 angle180 angle225 angle270 angle315 - angle)
(:init
    (AngleOrd angle0 angle45)
    (AngleOrd angle45 angle90)
    (AngleOrd angle90 angle135)
    (AngleOrd angle135 angle180)
    (AngleOrd angle180 angle225)
    (AngleOrd angle225 angle270)
    (AngleOrd angle270 angle315)
    (AngleOrd angle315 angle0)

    (Connected joint1 link1)
    (Connected joint1 link2)
    (Connected joint2 link2)
    (Connected joint2 link3)

    (HasAngle angle135 joint1)
    (HasAngle angle270 joint2)
)
(:goal
(and
    (HasAngle angle45 joint1)
    (HasAngle angle135 joint2)
    )
)
)

; plan
1. (decrease_angle link1 link2 joint1 angle135 angle90)
   deleted: (hasangle angle135 joint1)
   added: (hasangle angle90 joint1)
   goals met: 0 of 2
2. (decrease_angle link2 link3 joint2 angle270 angle225)
   deleted: (hasangle angle270 joint2)
   added: (hasangle angle225 joint2)
   goals met: 0 of 2
3. (decrease_angle link1 link2 joint1 angle90 angle45)
   deleted: (hasangle angle90 joint1)
   added: (hasangle angle45 joint1)
   goals met: 1 of 2
4. (decrease_angle link2 link3 joint2 angle225 angle180)
   deleted: (hasangle angle225 joint2)
   added: (hasangle angle180 joint2)
   goals met: 1 of 2
5. (decrease_angle link2 link3 joint2 angle180 angle135)
   deleted: (hasangle angle180 joint2)
   added: (hasangle angle135 joint2)
   goals met: 2 of 2
